lib/xml/createUser.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:createUser>
            <!--Optional:-->
            <userInfo>
                <!--Zero or more repetitions:-->
                <agentGroups>?</agentGroups>
                <!--Zero or more repetitions:-->
                <cannedReports>
                    <!--Optional:-->
                    <index>?</index>
                    <!--Optional:-->
                    <name>?</name>
                </cannedReports>
                <!--Optional:-->
                <generalInfo>
                    <!--Optional:-->
                    <active>?</active>
                    <!--Optional:-->
                    <canChangePassword>?</canChangePassword>
                    <!--Optional:-->
                    <EMail>?</EMail>
                    <!--Optional:-->
                    <extension>?</extension>
                    <!--Optional:-->
                    <federationId>?</federationId>
                    <!--Optional:-->
                    <firstName>?</firstName>
                    <!--Optional:-->
                    <fullName>?</fullName>
                    <!--Optional:-->
                    <IEXScheduled>?</IEXScheduled>
                    <!--Optional:-->
                    <id>?</id>
                    <!--Optional:-->
                    <lastName>?</lastName>
                    <!--Optional:-->
                    <locale>?</locale>
                    <!--Optional:-->
                    <mediaTypeConfig>
                        <!--Zero or more repetitions:-->
                        <mediaTypes>
                            <!--Optional:-->
                            <enabled>?</enabled>
                            <!--Optional:-->
                            <intlligentRouting>?</intlligentRouting>
                            <!--Optional:-->
                            <maxAlowed>?</maxAlowed>
                            <!--Optional:-->
                            <type>?</type>
                        </mediaTypes>
                    </mediaTypeConfig>
                    <!--Optional:-->
                    <mustChangePassword>?</mustChangePassword>
                    <!--Optional:-->
                    <osLogin>?</osLogin>
                    <!--Optional:-->
                    <password>?</password>
                    <!--Optional:-->
                    <phoneNumber>?</phoneNumber>
                    <!--Optional:-->
                    <startDate>?</startDate>
                    <!--Optional:-->
                    <unifiedCommunicationId>?</unifiedCommunicationId>
                    <!--Optional:-->
                    <userName>?</userName>
                    <!--Optional:-->
                    <userProfileName>?</userProfileName>
                </generalInfo>
                <!--Optional:-->
                <roles>
                    <!--Optional:-->
                    <admin>
                        <!--Zero or more repetitions:-->
                        <permissions>
                            <!--Optional:-->
                            <type>?</type>
                            <value>?</value>
                        </permissions>
                    </admin>
                    <!--Optional:-->
                    <agent>
                        <alwaysRecorded>?</alwaysRecorded>
                        <attachVmToEmail>?</attachVmToEmail>
                        <!--Zero or more repetitions:-->
                        <permissions>
                            <!--Optional:-->
                            <type>?</type>
                            <value>?</value>
                        </permissions>
                        <sendEmailOnVm>?</sendEmailOnVm>
                    </agent>
                    <!--Optional:-->
                    <crmManager>
                        <!--Zero or more repetitions:-->
                        <permissions>
                            <!--Optional:-->
                            <type>?</type>
                            <value>?</value>
                        </permissions>
                    </crmManager>
                    <!--Optional:-->
                    <reporting>
                        <!--Zero or more repetitions:-->
                        <permissions>
                            <!--Optional:-->
                            <type>?</type>
                            <value>?</value>
                        </permissions>
                    </reporting>
                    <!--Optional:-->
                    <supervisor>
                        <!--Zero or more repetitions:-->
                        <permissions>
                            <!--Optional:-->
                            <type>?</type>
                            <value>?</value>
                        </permissions>
                    </supervisor>
                </roles>
                <!--Zero or more repetitions:-->
                <skills>
                    <!--Optional:-->
                    <id>?</id>
                    <level>?</level>
                    <!--Optional:-->
                    <skillName>?</skillName>
                    <!--Optional:-->
                    <userName>?</userName>
                </skills>
            </userInfo>
        </ser:createUser>
    </soapenv:Body>
</soapenv:Envelope>